modules/dashboard/models/Student.php

    public static function generateAdmissionNo()
    {
        $year = date('Y');
        $prefix = 'STD/';
        $yearPrefix = '/' . $year;

        // Get the maximum admission number from the database
        $lastRecord = self::find()
            ->select(['admission_no'])
            ->orderBy(['admission_no' => SORT_DESC])
            ->limit(1)
            ->one();
---
SELECT `admission_no` FROM `student` ORDER BY `admission_no` DESC LIMIT 1