modules/dashboard/controllers/StaffController.php

SELECT * FROM `staff` WHERE `id`='a26eddea99b0bb9dad4bae0c93b83c2f9259f50897cba888a547212323dce971'
---
    protected function findModel($id)
    {
        if (($model = Staff::findOne(['id' => $id])) !== null) {