modules/dashboard/controllers/StudentController.php

    public function actionCreate()
    {
        $model = new Student();
        $user = new User();

        if ($this->request->isPost) {
            // Load the data into the Students model
            if ($model->load($this->request->post())) {

                // Generate and set the admission number
                $model->admission_no = Student::generateAdmissionNo();
                $model->id = IdGenerator::generateUniqueId();
                // $model->date_of_birth = strtotime($model->date_of_birth);

                // Set User attributes
                $user->id = IdGenerator::generateUniqueId();
                $user->username = $model->admission_no;  // Set username to admission_no
                $user->password_hash = Yii::$app->security->generatePasswordHash($user->username);  // Set password to hashed admission_no
                $user->auth_key = Yii::$app->security->generateRandomString();
                $user->status = 10; // Default status

                // Use a transaction to ensure both models are saved successfully
                $transaction = Yii::$app->db->beginTransaction();

                try {
                    // Save the User model first
                    if ($user->save()) {
---
INSERT INTO `user` (`id`, `username`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('da77c76f388c31812da056a7c1428b1974588e6609fdfc301139450ad973e811', 'STD/00001/2024', '$2y$13$/2VpQMGwmwYFb15oCx/NI.WC7bFe5S5nM4AaRUypqDgp2zm8AH/d6', 'rKqulED3vpC9sS2F9vOzl9wn__AQOWPR', 10, 1727442528, 1727442528)

    protected function findModel($id)
    {
        if (($model = Student::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `student` WHERE `id`='60ff180510d152e81be8a3dfdfd84b850df0d7894289457283028a648ba550cb'